In [28]:
import pandas as pd

In [29]:
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [30]:
school_data_complete.head()

,Student ID,student_name,gender,year,school_name,reading_score,maths_score,School ID,type,size,budget
0,0,Paul Bradley,M,9,Huang High School,96,94,0,Government,2917,1910635
1,1,Victor Smith,M,12,Huang High School,90,43,0,Government,2917,1910635
2,2,Kevin Rodriguez,M,12,Huang High School,41,76,0,Government,2917,1910635
3,3,Richard Scott,M,12,Huang High School,89,86,0,Government,2917,1910635
4,4,Bonnie Ray,F,9,Huang High School,87,69,0,Government,2917,1910635

In [31]:
school_count = school_data_complete["school_name"].nunique()
school_count

15

In [32]:
student_count = school_data_complete["student_name"].count()
student_count

39170

In [33]:
total_budget_df = school_data_complete.drop_duplicates(["budget"])
total_budget = total_budget_df["budget"].sum()
total_budget

24649428

In [34]:
average_maths = school_data_complete["maths_score"].mean()
average_maths = average_maths.round(6)
average_maths

70.338192

In [35]:
average_reading = school_data_complete["reading_score"].mean()
average_reading = average_reading.round(6)
average_reading

69.980138

In [36]:
pass_mark = 49.9
maths_pass = school_data_complete["maths_score"]
pass_count = maths_pass[maths_pass > pass_mark].count()
maths_pass_percent = pass_count/student_count*100
maths_pass_percent = maths_pass_percent.round(6)
maths_pass_percent

86.078632

In [37]:
pass_mark = 49.9
reading_pass = school_data_complete["reading_score"]
pass_count = reading_pass[reading_pass > pass_mark].count()
reading_pass_percent = pass_count/student_count*100
reading_pass_percent = reading_pass_percent.round(6)
reading_pass_percent

84.426857

In [38]:
pass_both_count = len(school_data_complete[(school_data_complete["maths_score"]>49.9) & (school_data_complete["reading_score"]>49.9)])
pass_both_percent = pass_both_count/student_count*100
pass_both_percent = pass_both_percent.round(6)
pass_both_percent

72.808272

In [39]:
LGA_Summary = pd.DataFrame([[school_count,student_count,total_budget,average_maths,average_reading,maths_pass_percent,reading_pass_percent,pass_both_percent]],
    columns=['Total Schools','Total Students','Total Budget','Average Maths Score','Average Reading Score','% Passing Maths','% Passing Reading',
    '% Overall Passing'])
LGA_Summary

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score,% Passing Maths,% Passing Reading,% Overall Passing
0,15,39170,24649428,70.338192,69.980138,86.078632,84.426857,72.808272

In [40]:
school_data.head()

   School ID            school_name         type  size   budget
0          0      Huang High School   Government  2917  1910635
1          1   Figueroa High School   Government  2949  1884411
2          2    Shelton High School  Independent  1761  1056600
3          3  Hernandez High School   Government  4635  3022020
4          4    Griffin High School  Independent  1468   917500

In [41]:
School_Summary = school_data

In [42]:
School_Summary["Per student budget"] = School_Summary["budget"] / School_Summary["size"]
School_Summary.head()

,School ID,school_name,type,size,budget,Per student budget
0,0,Huang High School,Government,2917,1910635,655.0
1,1,Figueroa High School,Government,2949,1884411,639.0
2,2,Shelton High School,Independent,1761,1056600,600.0
3,3,Hernandez High School,Government,4635,3022020,652.0
4,4,Griffin High School,Independent,1468,917500,625.0

In [48]:
school_avg_math = school_data_complete.groupby("school_name", as_index=False)["maths_score"].mean()
school_summary2 = pd.merge(School_Summary, school_avg_math, how="left", on=["school_name", "school_name"])
school_summary2.head()

,School ID,school_name,type,size,budget,Per student budget,maths_score
0,0,Huang High School,Government,2917,1910635,655.0,68.935207
1,1,Figueroa High School,Government,2949,1884411,639.0,68.698542
2,2,Shelton High School,Independent,1761,1056600,600.0,72.034072
3,3,Hernandez High School,Government,4635,3022020,652.0,68.874865
4,4,Griffin High School,Independent,1468,917500,625.0,71.788147

In [47]:
school_avg_read = school_data_complete.groupby("school_name", as_index=False)["reading_score"].mean()
school_summary3 = pd.merge(school_summary2, school_avg_read, how="left", on=["school_name", "school_name"])
school_summary3.head()

,School ID,school_name,type,size,budget,Per student budget,maths_score,reading_score
0,0,Huang High School,Government,2917,1910635,655.0,68.935207,68.910525
1,1,Figueroa High School,Government,2949,1884411,639.0,68.698542,69.077993
2,2,Shelton High School,Independent,1761,1056600,600.0,72.034072,70.257808
3,3,Hernandez High School,Government,4635,3022020,652.0,68.874865,69.186408
4,4,Griffin High School,Independent,1468,917500,625.0,71.788147,71.245232

In [72]:
school_pass_math = school_data_complete.groupby("school_name", as_index=False)["maths_score"].count()
school_pass_math =school_pass_math.rename(columns={"maths_score": "maths_total_count"})
school_pass_math.head()

            school_name  maths_total_count
0    Bailey High School               4976
1   Cabrera High School               1858
2  Figueroa High School               2949
3      Ford High School               2739
4   Griffin High School               1468

In [89]:
school_pass_math2 = school_data_complete[school_data_complete['maths_score'] > pass_mark].groupby('school_name').count()
#school_pass_math3 = school_pass_math2[["maths_score"]].copy()
#school_pass_math3 = school_pass_math2.loc[(school_pass_math2["maths_score"]), :]
school_pass_math3.head()

                      maths_score
school_name
Bailey High School           4560
Cabrera High School          1688
Figueroa High School         2408
Ford High School             2258
Griffin High School          1339

In [91]:
school_math_percent = pd.merge(school_pass_math, school_pass_math2[["maths_score"]], how="left", on=["school_name", "school_name"])
#df = pd.merge(df,df2[['Key_Column','Target_Column']],on='Key_Column', how='left')
school_math_percent.head()

            school_name  maths_total_count  maths_score
0    Bailey High School               4976         4560
1   Cabrera High School               1858         1688
2  Figueroa High School               2949         2408
3      Ford High School               2739         2258
4   Griffin High School               1468         1339

In [92]:
school_math_percent["% passing maths"] = school_math_percent["maths_score"] / school_math_percent["maths_total_count"] *100
school_math_percent.head()

            school_name  maths_total_count  maths_score  % passing maths
0    Bailey High School               4976         4560        91.639871
1   Cabrera High School               1858         1688        90.850377
2  Figueroa High School               2949         2408        81.654798
3      Ford High School               2739         2258        82.438846
4   Griffin High School               1468         1339        91.212534

In [97]:
school_summary4 = pd.merge(school_summary3, school_math_percent[["school_name", "% passing maths"]], how="left", on=["school_name", "school_name"])
school_summary4.head()

,School ID,school_name,type,size,budget,Per student budget,maths_score,reading_score,% passing maths
0,0,Huang High School,Government,2917,1910635,655.0,68.935207,68.910525,81.693521
1,1,Figueroa High School,Government,2949,1884411,639.0,68.698542,69.077993,81.654798
2,2,Shelton High School,Independent,1761,1056600,600.0,72.034072,70.257808,91.538898
3,3,Hernandez High School,Government,4635,3022020,652.0,68.874865,69.186408,80.949299
4,4,Griffin High School,Independent,1468,917500,625.0,71.788147,71.245232,91.212534

In [105]:
school_pass_read = school_data_complete.groupby("school_name", as_index=False)["reading_score"].count()
school_pass_read = school_pass_read.rename(columns={"reading_score": "reading_total_count"})
school_pass_read2 = school_data_complete[school_data_complete['reading_score'] > pass_mark].groupby('school_name').count()
school_read_percent = pd.merge(school_pass_read, school_pass_read2[["reading_score"]], how="left", on=["school_name", "school_name"])
school_read_percent["% passing reading"] = school_read_percent["reading_score"] / school_read_percent["reading_total_count"] *100
school_read_percent.head()

            school_name  reading_total_count  reading_score  % passing reading
0    Bailey High School                 4976           4348          87.379421
1   Cabrera High School                 1858           1655          89.074273
2  Figueroa High School                 2949           2442          82.807731
3      Ford High School                 2739           2252          82.219788
4   Griffin High School                 1468           1299          88.487738

In [107]:
school_summary5 = pd.merge(school_summary4, school_read_percent[["school_name", "% passing reading"]], how="left", on=["school_name", "school_name"])
school_summary5.head()

,School ID,school_name,type,size,budget,Per student budget,maths_score,reading_score,% passing maths,% passing reading
0,0,Huang High School,Government,2917,1910635,655.0,68.935207,68.910525,81.693521,81.453548
1,1,Figueroa High School,Government,2949,1884411,639.0,68.698542,69.077993,81.654798,82.807731
2,2,Shelton High School,Independent,1761,1056600,600.0,72.034072,70.257808,91.538898,86.712095
3,3,Hernandez High School,Government,4635,3022020,652.0,68.874865,69.186408,80.949299,81.877023
4,4,Griffin High School,Independent,1468,917500,625.0,71.788147,71.245232,91.212534,88.487738

In [109]:
school_pass_read = school_data_complete.groupby("school_name", as_index=False)["reading_score"].count()
school_pass_read

              school_name  reading_score
0      Bailey High School           4976
1     Cabrera High School           1858
2    Figueroa High School           2949
3        Ford High School           2739
4     Griffin High School           1468
5   Hernandez High School           4635
6      Holden High School            427
7       Huang High School           2917
8     Johnson High School           4761
9        Pena High School            962
10  Rodriguez High School           3999
11    Shelton High School           1761
12     Thomas High School           1635
13     Wilson High School           2283
14     Wright High School           1800

In [116]:
school_pass_both = school_data_complete[(school_data_complete['maths_score'] > pass_mark) & (school_data_complete['reading_score'] > pass_mark)].groupby('school_name').count()
school_pass_both.head()

,Student ID,student_name,gender,year,reading_score,maths_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,3985,3985,3985,3985,3985,3985,3985,3985,3985,3985
Cabrera High School,1501,1501,1501,1501,1501,1501,1501,1501,1501,1501
Figueroa High School,1995,1995,1995,1995,1995,1995,1995,1995,1995,1995
Ford High School,1848,1848,1848,1848,1848,1848,1848,1848,1848,1848
Griffin High School,1194,1194,1194,1194,1194,1194,1194,1194,1194,1194

In [118]:
school_both_percent = pd.merge(school_pass_read, school_pass_both[["size"]], how="left", on=["school_name", "school_name"])
school_both_percent["% overall passing"] = school_both_percent["size"] / school_both_percent["reading_score"] *100
school_both_percent.head()

            school_name  reading_score  size  % overall passing
0    Bailey High School           4976  3985          80.084405
1   Cabrera High School           1858  1501          80.785791
2  Figueroa High School           2949  1995          67.650051
3      Ford High School           2739  1848          67.469880
4   Griffin High School           1468  1194          81.335150

In [119]:
school_summary6 = pd.merge(school_summary5, school_both_percent[["school_name", "% overall passing"]], how="left", on=["school_name", "school_name"])
school_summary6.head()

,School ID,school_name,type,size,budget,Per student budget,maths_score,reading_score,% passing maths,% passing reading,% overall passing
0,0,Huang High School,Government,2917,1910635,655.0,68.935207,68.910525,81.693521,81.453548,66.712376
1,1,Figueroa High School,Government,2949,1884411,639.0,68.698542,69.077993,81.654798,82.807731,67.650051
2,2,Shelton High School,Independent,1761,1056600,600.0,72.034072,70.257808,91.538898,86.712095,78.875639
3,3,Hernandez High School,Government,4635,3022020,652.0,68.874865,69.186408,80.949299,81.877023,66.364617
4,4,Griffin High School,Independent,1468,917500,625.0,71.788147,71.245232,91.212534,88.487738,81.335150